app/Http/Controllers/awal/RancanganController.php

    public function index(Request $request)
    {
        $canEntry = can_entry($this->tahapan);
        $canManage = false;
        $canTransfer = can_transfer('Rancangan Renja');
        $user = auth()->user();
        $tahapan = Tahapan::whereNama(\App\Enum\Tahapan::RANCANGAN_AWAL)->firstOrFail();
        $items = new Anggaran();
        $items = $items->whereTahapanId($tahapan->id);

        if ($user->hasRole(Roles::KECAMATAN) || $user->hasRole(Roles::OPD)) {
            $items = $items->whereUserId($request->user()->id);
            $canManage = true;
        }

        $search = $request->get('search');
        $items  = $items->search($search)
            ->orderBy('created_at', 'ASC')
            ->paginate(10);
---
select * from `tahapan` where `nama` = 'Rancangan Awal Renja' limit 1
select * from `anggaran` where `tahapan_id` = 5 and `user_id` = 24 order by `created_at` asc limit 10 offset 0
select count(*) as aggregate from `anggaran` where `tahapan_id` = 5 and `user_id` = 24

    public function doTransfer(Request $request, $id)
    {
        // -- adding code
        if (!$request->isViewTransfer) {
            if (empty($request->pilihan)) {
                $this->validate($request, [
                    'pilihan' => 'required'
                ]);
            }
            if ($request->pilihan) {
                $this->validate($request, [
                    'catatan' => 'required'
                ]);
            }
        }
        // --

        $anggaran = Anggaran::find($id);
        $tahapan = Tahapan::whereNama(\App\Enum\Tahapan::RANCANGAN_RENJA)->firstOrFail();
---
select * from `anggaran` where `anggaran`.`id` = '20165' limit 1
select * from `tahapan` where `nama` = 'Rancangan Renja' limit 1

        if ((!empty($tahapan) && $request->pilihan) or ($isViewTransfer == 0)) {
            $newAnggaran = $this->musrenbang_service->transfer($anggaran, $tahapan->id);
            $anggaran->is_transfer = true;
            $anggaran->save();
---
update `anggaran` set `is_transfer` = 1, `updated_at` = '2019-03-05 08:25:42' where `id` = 20156