app/Http/Controllers/awal/RancanganController.php

select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 13 limit 1
select * from `anggaran` where `tahapan_id` = 5 and `opd_pelaksana_id` = 31 order by `created_at` asc limit 10 offset 40
select count(*) as aggregate from `anggaran` where `tahapan_id` = 5 and `opd_pelaksana_id` = 31
---
    public function index(Request $request)
    {
        $canEntry = can_entry($this->tahapan);
        $canManage = false;
        $canTransfer = can_transfer('Rancangan Renja');
        $user = auth()->user();
        $tahapan = Tahapan::whereNama(\App\Enum\Tahapan::RANCANGAN_AWAL)->firstOrFail();
        $items = new Anggaran();
        $items = $items->whereTahapanId($tahapan->id);

        $opd = $user->opd()->first();

        if ($user->hasRole(Roles::KECAMATAN) || $user->hasRole(Roles::OPD)) {
            // $items = $items->whereUserId($request->user()->id);
            $items = $items->where('opd_pelaksana_id', '=', $opd->id);
            $canManage = true;
        }

        $search = $request->get('search');
        $items  = $items->search($search)
            ->orderBy('created_at', 'ASC')
            ->paginate(10);

select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 65 limit 1
select `kegiatan`.`id`, `kegiatan`.`nama` as `full_name` from `kegiatan` inner join `opd_kegiatan` on `opd_kegiatan`.`kegiatan_id` = `kegiatan`.`id` inner join `opd` on `opd`.`id` = `opd_kegiatan`.`opd_id` where `kegiatan`.`nama` like '%laporan%' and `opd`.`id` = 63
---
    public function lookupKegiatanByName(Request $request)
    {
        $opd = auth()->user()->opd()->first();
        $kegiatan = Kegiatan::where('kegiatan.nama', 'like', '%' . $request->input('q') . '%')
            ->select('kegiatan.id', 'kegiatan.nama as full_name')
            ->join('opd_kegiatan', 'opd_kegiatan.kegiatan_id', '=', 'kegiatan.id')
            ->join('opd', 'opd.id', '=', 'opd_kegiatan.opd_id')
            ->where('opd.id', $opd->id)
            ->get();