app/Services/DashboardService.php

    public function getData($tahapan, $tahapan_name)
    {
        $user = auth()->user();
        $items = Anggaran::whereTahapanId($tahapan);

        if ($user->hasRole(Roles::DESA)) {
            $items = $items->AllByUser();
        }

        if ($user->hasRole(Roles::KELURAHAN)) {
            $items = $items->AllByUser();
        }

        if ($user->hasRole(Roles::KECAMATAN) && $user->opd->first()) {
            $query = '%Kecamatan: '.strtoupper($user->name).',%';
            $items = $items->where('lokasi', 'like' , $query);
        }

        if ($user->hasRole(Roles::OPD) && $user->opd->first()) {
            if ($tahapan_name == TahapanName::POKOK_PIKIRAN_DEWAN) {
                $items = $items->whereOpdId($user->opd()->first()->id);
            }
            if ($tahapan_name == TahapanName::KECAMATAN) {
                $items = $items->whereOpdId($user->opd()->first()->id);
---
select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 76
select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 30
select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 30 limit 1