app/Services/MusrenbangService.php

select * from `status_kegiatan` where `status_kegiatan`.`id` = 2 limit 1
select * from `kegiatan` where `kegiatan`.`id` = '42' limit 1
select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 250
select * from `jenis_lokasi` where `jenis_lokasi`.`id` = '3' limit 1
select * from `sumber_anggaran` where `sumber_anggaran`.`id` = '3' limit 1
select `opd`.*, `opd_kegiatan`.`kegiatan_id` as `pivot_kegiatan_id`, `opd_kegiatan`.`opd_id` as `pivot_opd_id` from `opd` inner join `opd_kegiatan` on `opd`.`id` = `opd_kegiatan`.`opd_id` where `opd_kegiatan`.`kegiatan_id` = 42 limit 1
---
    public function store($request, $tahapan, $is_kelurahan = false)
    {

        if ($request->input('kecamatan') && $request->input('desa')) {
            $kecamatan = Districts::find($request->input('kecamatan'));
            $desa = Villages::find($request->input('desa'));
            if ($desa && $kecamatan) {
                $lokasi = 'Kecamatan : ' . $kecamatan->name . '; Desa/Kelurahan : ' . $desa->name;
            }
        }

        if ($request->input('lokasi')) {
            $lokasi = $request->input('lokasi');
        }

        $status_kegiatan = $request->input('status_kegiatan');

        if (empty($request->input('status_kegiatan'))) {
            $status_kegiatan = 2;
        }

        $statusKegiatan = StatusKegiatan::find($status_kegiatan);

        $opdId = $request->user()->opd->first();
        $jenisLokasi = JenisLokasi::find($request->input('lokasi_kegiatan'));
        $sumberAnggaran = SumberAnggaran::find($request->input('sumber_anggaran'));
        $kegiatan = Kegiatan::find($request->input('nama_kegiatan'));

        $anggaran = new Anggaran();
        $anggaran->tahun = $request->input('tahun');
        $anggaran->opd()->associate($kegiatan->opd()->first());

insert into `anggaran` (`tahun`, `opd_id`, `opd_pelaksana_id`, `target_hk`, `lokasi`, `is_kelurahan`, `tahapan_id`, `status_kegiatan_id`, `jenis_lokasi_id`, `user_id`, `sumber_anggaran_id`, `kegiatan_id`, `village_id`, `district_id`, `updated_at`, `created_at`) values ('2020', 16, 16, '', 'Kecamatan: WARUNG KIARA, Desa/Kelurahan: GIRIJAYA. asag;', 0, 3, 2, 3, 250, 3, 42, '3202120007', '3202120', '2018-12-02 22:25:12', '2018-12-02 22:25:12')
---

        $this->storeVillageAndDesa($anggaran, $tahapan);

        $anggaran->save();

select * from `indikator_kegiatan` where `indikator_kegiatan`.`id` = 3429 limit 1
---

        if ($targets) {
            foreach ($targets as $id => $target) {
                $indikatorKegiatan = IndikatorKegiatan::find($id);

select * from `anggaran` where `anggaran`.`id` = '42000' limit 1
select * from `districts` where `districts`.`id` = '3202120' limit 1
select * from `villages` where `villages`.`id` = '3202120007' limit 1
select * from `status_kegiatan` where `status_kegiatan`.`id` = 2 limit 1
select * from `kegiatan` where `kegiatan`.`id` = '42' limit 1
select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 250
select * from `jenis_lokasi` where `jenis_lokasi`.`id` = '3' limit 1
select * from `sumber_anggaran` where `sumber_anggaran`.`id` = '3' limit 1
select `opd`.*, `opd_kegiatan`.`kegiatan_id` as `pivot_kegiatan_id`, `opd_kegiatan`.`opd_id` as `pivot_opd_id` from `opd` inner join `opd_kegiatan` on `opd`.`id` = `opd_kegiatan`.`opd_id` where `opd_kegiatan`.`kegiatan_id` = 42 limit 1
---
    public function update($request, $id)
    {
        $anggaran = Anggaran::findOrFail($id);

        if ($request->input('kecamatan') && $request->input('desa')) {
            $kecamatan = Districts::find($request->input('kecamatan'));
            $desa = Villages::find($request->input('desa'));
            if ($desa && $kecamatan) {
                $lokasi = 'Kecamatan : ' . $kecamatan->name . '; Desa/Kelurahan : ' . $desa->name;
            }
        }


        if ($request->input('lokasi')) {
            $lokasi = $request->input('lokasi');
        }

        $status_kegiatan = $request->input('status_kegiatan');

        if (empty($request->input('status_kegiatan'))) {
            $status_kegiatan = 2;
        }

        $statusKegiatan = StatusKegiatan::find($status_kegiatan);

        $opdId = $request->user()->opd->first();
        $jenisLokasi = JenisLokasi::find($request->input('lokasi_kegiatan'));
        $sumberAnggaran = SumberAnggaran::find($request->input('sumber_anggaran'));
        $kegiatan = Kegiatan::find($request->input('nama_kegiatan'));

        $anggaran->tahun = $request->input('tahun');
        $anggaran->opd()->associate($kegiatan->opd()->first());

delete from `target_anggaran` where `anggaran_id` = 42000
select * from `indikator_kegiatan` where `indikator_kegiatan`.`id` = 3428 limit 1
---

        $targets = $request->input('target_indikator_kegiatan');

        TargetAnggaran::whereAnggaranId($anggaran->id)->delete();

        if ($targets) {
            foreach ($targets as $id => $target) {
                $indikatorKegiatan = IndikatorKegiatan::find($id);

insert into `anggaran` (`tahun`, `opd_id`, `opd_pelaksana_id`, `tahapan_id`, `kegiatan_id`, `status_kegiatan_id`, `sumber_anggaran_id`, `jenis_lokasi_id`, `lokasi`, `file_kak`, `file_foto`, `anggaran_id`, `is_transfer`, `is_verifikasi`, `is_kelurahan`, `district_id`, `village_id`, `pagu`, `prioritas`, `proposal`, `sumber_awal`, `user_id`, `updated_at`, `created_at`) values (2020, 63, 63, 7, 2412, 2, 3, 3, 'Kecamatan: SURADE, Desa/Kelurahan: SURADE. kantor Kecamatan Surade;', '', '', 33599, 0, 0, 0, '', 2147483647, '', '', '', 5, 65, '2019-05-19 11:13:59', '2019-05-19 11:13:59')
---
    public function transfer($anggaran, $tahapan_id)
    {
        $item                     = New Anggaran();
        $item->tahun              = $anggaran->tahun;
        $item->opd_id             = $anggaran->opd_id;
        $item->opd_pelaksana_id   = $anggaran->opd_pelaksana_id;
        $item->tahapan_id         = $tahapan_id;
        $item->kegiatan_id        = $anggaran->kegiatan_id;
        $item->status_kegiatan_id = $anggaran->status_kegiatan_id;
        $item->sumber_anggaran_id = $anggaran->sumber_anggaran_id;
        $item->jenis_lokasi_id    = $anggaran->jenis_lokasi_id;
        $item->lokasi             = $anggaran->lokasi;
        $item->file_kak           = $anggaran->file_kak;
        $item->file_foto          = $anggaran->file_foto;
        $item->anggaran_id        = $anggaran->id;
        $item->is_transfer        = false;
        $item->is_verifikasi      = false;
        $item->is_kelurahan       = $anggaran->is_kelurahan;
        $item->district_id        = $anggaran->district_id;
        $item->village_id         = $anggaran->village_id;
        $item->pagu               = $anggaran->pagu;
        $item->prioritas          = $anggaran->prioritas;
        $item->proposal           = $anggaran->proposal;
        $item->user()->associate(auth()->user());
        $item->save();

select * from `indikator_kegiatan` where `indikator_kegiatan`.`id` = 4642 limit 1
insert into `target_anggaran` (`anggaran_id`, `indikator_kegiatan_id`, `target`, `updated_at`, `created_at`) values (33603, 4642, '4', '2019-05-19 11:14:00', '2019-05-19 11:14:00')
select * from `indikator_kegiatan` where `indikator_kegiatan`.`id` = 4643 limit 1
insert into `target_anggaran` (`anggaran_id`, `indikator_kegiatan_id`, `target`, `updated_at`, `created_at`) values (33603, 4643, '0', '2019-05-19 11:14:00', '2019-05-19 11:14:00')
---
    public function storeTargetAnggaran($request, $anggaran)
    {
        $targets = $request->input('target_indikator_kegiatan');

        if ($targets) {
            foreach ($targets as $id => $target) {
                $indikatorKegiatan = IndikatorKegiatan::find($id);
                $ta = new TargetAnggaran();
                $ta->anggaran()->associate($anggaran);
                $ta->indikatorKegiatan()->associate($indikatorKegiatan);
                $ta->target = $target;
                $ta->save();
            }
        }

        $hasil = $request->input('target_indikator_hasil');
        if ($hasil) {
            foreach ($hasil as $id => $target) {
                $indikatorKegiatan = IndikatorKegiatan::find($id);
                $ta = new TargetAnggaran();
                $ta->anggaran()->associate($anggaran);
                $ta->indikatorKegiatan()->associate($indikatorKegiatan);
                $ta->target = $target ?? 0;
                $ta->save();