app/Http/Controllers/laporan/kecamatan/LaporanController.php

    public function __construct(DashboardService $dashboard_service)
    {
        $this->dashboard_service = $dashboard_service;
        $this->tahapan = Tahapan::whereNama(\App\Enum\Tahapan::KECAMATAN)->first();
---
select * from `tahapan` where `nama` = 'Musrenbang Kecamatan' limit 1

    public function index(Request $request)
    {
        ini_set('max_execution_time', 0);
        ini_set('memory_limit','2048M');
        $opd = $request->user()->opd()->first();
        $village = get_village($request->user()->opd->first()->kode ?? null);
        $villages = Villages::pluck('name', 'id');

        if ($request->user()->hasRole(Roles::KECAMATAN)) {
            if ($opd->jenisOpd && $opd->jenisOpd->nama == Roles::KECAMATAN) {
                $district = Districts::find($opd->kode);
                $villages = Villages::whereDistrictId($opd->kode)->pluck('name', 'id');
---
select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 44 limit 1
select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 44
select `name`, `id` from `villages`
select * from `districts` where `districts`.`id` = '3202260' limit 1
select `name`, `id` from `villages` where `district_id` = '3202260'

    public function preview(Request $request)
    {
        ini_set('max_execution_time', 0);
        ini_set('memory_limit','2048M');
        $district = Districts::find($request->get('district_id', null));
        $village = Villages::find($request->get('village_id', null));
---
select * from `districts` where `districts`.`id` = '3202050' limit 1
select * from `villages` where `villages`.`id` is null limit 1

    public function show(Request $request)
    {
        $district = $request->get('district', null);
        $village = $request->get('village', null);
        $user_id = $request->get('user', null);
        // $program = \App\Program::all();

        $items = new Anggaran();
        $items = $items->withLaporan()->whereTahapanId($this->tahapan->id);
        // $sasaran =\App\Sasaran::all();
        // $indikatorsasaran =\App\IndikatorSasaran::all();
        $kecamatan = Districts::find($district);
        $desa = Villages::find($village);
        $opd = $request->user()->opd()->first();
---
select * from `districts` where `districts`.`id` = '3202050' limit 1
select * from `villages` where `villages`.`id` is null limit 1
select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 45 limit 1

        }

        if ($user_id && $user_id != 0){
            $user = User::find($user_id);
---
select * from `users` where `users`.`id` in (45)