routes/web.php

    // route download proposal
    Route::get('download/{id}', function($id)
    {
        $data = \App\Anggaran::where('id', $id)->first();
---
select * from `anggaran` where `id` = '20158' limit 1