app/Http/Controllers/kerja/RancanganController.php

select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 89 limit 1
---
    public function index(Request $request)
    {
        $canEntry = can_entry($this->tahapan);
        $canManage = false;
        $canTransfer = can_transfer('Musrenbang Kabupaten');
        $user = auth()->user();
        // $tahapan = Tahapan::whereNama($this->tahapan)->firstOrFail();

        $bidang_nama = $user->roles->pluck('name'); //bidang
        $opd = $user->opd()->first();

select * from `tahapan` where `nama` = 'Rancangan Renja' limit 1
---


        if ($bidang_nama[0] == "Administrator" or $bidang_nama[0] == "Kecamatan" or $bidang_nama[0] == "OPD") {
            $tahapan = Tahapan::whereNama($this->tahapan)->firstOrFail();

select `nama_lengkap` from `users` where `id` = 89
select `id` from `bidangs` where `nama` like 'BIDANG PEMBANGUNAN MANUSIA DAN MASYARAKAT'
select * from `tahapan` where `nama` = 'Rancangan Renja' limit 1
select * from `bidang_permissions` where `bidang_id` = 1
---

        else {
            $user_id = $user->id;
            $nama_lengkap = User::whereId($user_id)->pluck('nama_lengkap');
            $nama_lengkap_up = strtoupper($nama_lengkap[0]);
            $bidang_id   = Bidang::where('nama', 'like', $nama_lengkap_up)->pluck('id');
            $tahapan = Tahapan::whereNama($this->tahapan)->firstOrFail();
            $bidang_permission = BidangPermission::where('bidang_id', $bidang_id)->get();

select `opd`.`id`, `opd`.`nama` from `bidang_permissions` inner join `opd` on `bidang_permissions`.`opd_id` = `opd`.`id` where `bidang_permissions`.`bidang_id` = 1 order by `opd`.`nama` asc
---
            $canTransfer = true;
            $search_keyword = $request->search;

            $opd_bidang = DB::table('bidang_permissions')
                                ->join('opd', 'bidang_permissions.opd_id', 'opd.id')
                                ->where('bidang_permissions.bidang_id', $bidang_id)
                                ->orderBy('opd.nama')
                                ->select('opd.id', 'opd.nama')
                                ->get();

select * from `anggaran` where `anggaran`.`id` = '4513' limit 1
select * from `districts`
select * from `jenis_lokasi`
select * from `sumber_anggaran`
select * from `sumber_anggaran` where `nama` = 'Pagu Indikatif' limit 1
---
    public function show($id)
    {
        $item = Anggaran::findOrFail($id);
        $districts = Districts::all();
        $visi = Visi::active();
        $jenisLokasi = JenisLokasi::all();
        $sumberAnggarans = SumberAnggaran::all();
        $sumberAnggaranPuguIndikatif = SumberAnggaran::whereNama('Pagu Indikatif')->first();

select * from `anggaran` where `anggaran`.`id` = '33599' limit 1
select * from `tahapan` where `nama` = 'Musrenbang Kabupaten' limit 1
---
    public function doTransfer(Request $request, $id)
    {
        $username = auth()->user()->name;

        if (strpos($username, 'bidang') !== false) {
            $anggaran = Anggaran::find($id);
            if($request->pilihan){
                $anggaran->is_checked = 1;
                $anggaran->save();
            }

            echo '<script type="text/javascript">'
               , 'alert("Berhasil Verifikasi Data");history.go(-2);location.reload(true);'
			   , '</script>';

            // return redirect(route('kerja.index'))->with('alert', [
            //     'type' => 'success',
            //     'alert' => 'Berhasil !',
            //     'message' => 'Berhasil Verifikasi Data.',
            // ]);
        }
        else {
            $anggaran = Anggaran::find($id);
            $tahapan = Tahapan::whereNama(\App\Enum\Tahapan::KABUPATEN)->firstOrFail();