app/Http/Controllers/kerja/RancanganController.php

            $tahapan = Tahapan::whereNama($this->tahapan)->firstOrFail();
            $items = new Anggaran();
            if ($bidang_nama[0] <> "Administrator") {
                $user_opd = DB::table('users_opd')->where('user_id', $user->id)->first();
---
select * from `users_opd` where `user_id` = 13 limit 1