app/Http/Controllers/dewan/MusrenbangController.php

select * from `tahapan` where `nama` = 'Pokok Pikiran Dewan' limit 1
select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 30 limit 1
select * from `anggaran` where `tahapan_id` = 2 and `opd_id` = 23 order by `created_at` asc limit 10 offset 0
select count(*) as aggregate from `anggaran` where `tahapan_id` = 2 and `opd_id` = 23
---
    public function index(Request $request)
    {
        // CEK APAKAH USER BISA ENTRY pada tahapan saat ini
        $user       = auth()->user();
        $canEntry   = can_entry($this->tahapan);
        $canManage  = $user->hasRole(Roles::DPRD);
        $tahapan    = Tahapan::whereNama(\App\Enum\Tahapan::POKOK_PIKIRAN_DEWAN)->firstOrFail();
        $canTransfer = false;

        $items = new Anggaran();
        $items = $items->whereTahapanId($tahapan->id);

        // jika user dprd maka munculkan anggaran yang hanya dia buat saja
        if ($user->hasRole(Roles::DPRD)) {
            $items = $items->whereUserId($user->id);
        }

        // Jika user opd maka tampilkan list anggaran hanya di opd dia saja
        if ($user->hasRole(Roles::OPD)) {
            $canTransfer = true;
            $items = $items->whereOpdId($user->opd()->first()->id);
        }

        // fungsi search
        $search = $request->get('search');
        $items  = $items->search($search)
            ->orderBy('created_at', 'ASC')
            ->paginate(10);

select * from `anggaran` where `anggaran`.`id` = '17830' limit 1
select * from `tahapan` where `nama` = 'Rancangan Renja' limit 1
---
    public function doTransfer(Request $request, $id)
    {
        // -- adding code
        if (!$request->isViewTransfer) {
            if (empty($request->pilihan)) {
                $this->validate($request, [
                    'pilihan' => 'required'
                ]);
            }
            if ($request->pilihan) {
                $this->validate($request, [
                    'catatan' => 'required'
                ]);
            }
        }
        // --

        $anggaran = Anggaran::find($id);
        $tahapan = Tahapan::whereNama(\App\Enum\Tahapan::RANCANGAN_RENJA)->firstOrFail();