app/Anggaran.php

    public function scopeTahapanAndIsKelurahan($query, $name_tahapan, $is_kelurahan = false)
    {
        $tahapan = Tahapan::whereNama($name_tahapan)->firstOrFail();
---
select * from `tahapan` where `nama` = 'Musrenbang Desa/Kelurahan' limit 1