app/Http/Controllers/akhir/RancanganController.php

    public function index(Request $request)
    {
        $canEntry = can_entry($this->tahapan);
        $canManage = false;
        $canTransfer = can_transfer('Rancangan KUA PPAS');
        $user = auth()->user();
        $tahapan = Tahapan::whereNama($this->tahapan)->firstOrFail();
        $items = new Anggaran();
        $items = $items->whereTahapanId($tahapan->id);

        if ($user->hasRole(Roles::OPD)) {
            $items = $items->whereUserId($request->user()->id);
            $canManage = true;
            $canTransfer = true;
        }

        $search = $request->get('search');
        $items  = $items->search($search)
            ->orderBy('created_at', 'ASC')
            ->paginate(10);
---
select * from `tahapan` where `nama` = 'Rancangan Akhir Renja' limit 1
select count(*) as aggregate from `anggaran` where `tahapan_id` = 8