app/Http/Controllers/laporan/kabupaten/LaporanController.php

    public function __construct(DashboardService $dashboard_service)
    {
        $this->dashboard_service = $dashboard_service;
        $this->tahapan = Tahapan::whereNama(\App\Enum\Tahapan::KABUPATEN)->first();
---
select * from `tahapan` where `nama` = 'Musrenbang Kabupaten' limit 1

    public function store(Request $request)
    {
//        dd($request->all());
        $district = Districts::find($request->get('district_id', null));
        $village = Villages::find($request->get('village_id', null));
        $user = User::find($request->get('user_id'), null);
---
select * from `districts` where `districts`.`id` = '3202030' limit 1
select * from `villages` where `villages`.`id` = '0' limit 1
select * from `users` where `users`.`id` = '65' limit 1

    public function show(Request $request)
    {
        $district = $request->get('district', null);
        $village = $request->get('village', null);
        $user_id = $request->get('user', null);

        $program = \App\Program::all();
        $sasaran =\App\Sasaran::all();
        $urusan = \App\BidangUrusan::all();
        $indikatorsasaran =\App\IndikatorSasaran::all();

        $items = new Anggaran();
        $items = $items->withLaporan()->whereTahapanId($this->tahapan->id);

        $kecamatan = Districts::find($district);
        $desa = Villages::find($village);
---
select * from `program`
select * from `indikator_sasaran`
select * from `sasaran`
select * from `districts` where `districts`.`id` = '3202030' limit 1
select * from `villages` where `villages`.`id` is null limit 1

        }

        if ($user_id && $user_id != 0) {
            $user = User::find($user_id);
---
select * from `users` where `users`.`id` in (65)