app/Http/Controllers/desa/MusrenbangController.php

select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 81
select * from `anggaran` where `tahapan_id` = 3 and `is_kelurahan` = 0 and `lokasi` like '%Kecamatan: CIRACAP,%' order by `created_at` asc limit 10 offset 10
select count(*) as aggregate from `anggaran` where `tahapan_id` = 3 and `is_kelurahan` = 0 and `lokasi` like '%Kecamatan: CIRACAP,%'
---
    public function index(Request $request)
    {
        // get user
        $user = auth()->user();

        // CEK APAKAH USER BISA ENTRY pada tahapan saat ini
        $canEntry = can_entry($this->tahapan);

        // cek apakah user bisa manage tahapan saat ini
        $canManage = $user->hasRole(Roles::DESA);
        $canTransfer = $user->hasRole(Roles::KECAMATAN);

        // get data anggaran berdasarkan tahapan name dan is_kelurahan, is_kelurahan default false
        $items = Anggaran::TahapanAndIsKelurahan(\App\Enum\Tahapan::DESA);

        // jika user role desa tampilkan data yang dia buat
        if ($user->hasRole(Roles::DESA)) {
            $items = $items->AllByUser();
        }

        // jika user role kecamatan tampilkan data sesuai district id user login
        if ($user->hasRole(Roles::KECAMATAN) && $user->opd->first()) {
            $query = '%Kecamatan: '.strtoupper($user->name).',%';
            $items = $items->where('lokasi', 'like' , $query);
        }

        // print_r($query);

        // fungsi search
        $search = $request->get('search');
        $items  = $items->search($search)
            ->orderBy('created_at', 'ASC')
            ->paginate(10);

select * from `districts`
select * from `jenis_lokasi`
select * from `sumber_anggaran`
select * from `sumber_anggaran` where `nama` = 'Pagu Indikatif' limit 1
---
    public function create()
    {
        if (! can_entry($this->tahapan)) {
            return error_pages(400, ErrorMessages::CLOSED_ENTRY);
        }

        $districts = Districts::all();
        $visi = Visi::active();
        $jenisLokasi = JenisLokasi::all();
        $sumberAnggarans = SumberAnggaran::all();
        $sumberAnggaranPuguIndikatif = SumberAnggaran::whereNama('Pagu Indikatif')->first();

select * from `tahapan` where `nama` = 'Musrenbang Desa/Kelurahan' limit 1
select * from `kegiatan` where `kegiatan`.`id` = '42' limit 1
select `opd`.*, `opd_kegiatan`.`kegiatan_id` as `pivot_kegiatan_id`, `opd_kegiatan`.`opd_id` as `pivot_opd_id` from `opd` inner join `opd_kegiatan` on `opd`.`id` = `opd_kegiatan`.`opd_id` where `opd_kegiatan`.`kegiatan_id` = 42 limit 1
---
    public function store(Request $request)
    {
        if (! can_entry($this->tahapan)) {
            return error_pages(400, ErrorMessages::CLOSED_ENTRY);
        }

        $this->validate($request, [
            'tahun' => 'required',
            'sumber_anggaran' => 'required',
            'nama_kegiatan' => 'required|max:255',
            'lokasi_kegiatan' => 'required',
            'lokasi' => 'required'
        ]);

        $tahapan = Tahapan::whereNama(\App\Enum\Tahapan::DESA)->firstOrFail();

        // cek opd
        $kegiatan = Kegiatan::find($request->input('nama_kegiatan'));
        if (!$kegiatan->opd()->first()) {

select * from `anggaran` where `anggaran`.`id` = '975' limit 1
select * from `districts`
select * from `jenis_lokasi`
select * from `sumber_anggaran`
select * from `sumber_anggaran` where `nama` = 'Pagu Indikatif' limit 1
---
    public function show($id)
    {
        $item = Anggaran::findOrFail($id);
        $districts = Districts::all();
        $visi = Visi::active();
        $jenisLokasi = JenisLokasi::all();
        $sumberAnggarans = SumberAnggaran::all();
        $sumberAnggaranPuguIndikatif = SumberAnggaran::whereNama('Pagu Indikatif')->first();

select * from `kegiatan` where `kegiatan`.`id` = '42' limit 1
select `opd`.*, `opd_kegiatan`.`kegiatan_id` as `pivot_kegiatan_id`, `opd_kegiatan`.`opd_id` as `pivot_opd_id` from `opd` inner join `opd_kegiatan` on `opd`.`id` = `opd_kegiatan`.`opd_id` where `opd_kegiatan`.`kegiatan_id` = 42 limit 1
---
    public function update(Request $request, $id)
    {
        if (! can_entry($this->tahapan)) {
            return error_pages(400, ErrorMessages::CLOSED_ENTRY);
        }

        $this->validate($request, [
            'tahun' => 'required',
            'nama_kegiatan' => 'required|max:255',
            'lokasi_kegiatan' => 'required',
            'lokasi'          => 'required'

        ]);

        // cek opd
        $kegiatan = Kegiatan::find($request->input('nama_kegiatan'));
        if (!$kegiatan->opd()->first()) {

select `id`, `nama` as `full_name` from `kegiatan` where (`nama` like '%asa%' or `keyword` like '%asa%') and `is_active` = 1
---
    public function lookupKegiatanByName(Request $request)
    {
        $val = '%' . $request->input('q') . '%';
        $kegiatan = Kegiatan::where(function($query) use ($val){
                $query->where('nama', 'like', $val);
                $query->orWhere('keyword', 'like', $val);
            })
            ->where('is_active', 1)
            ->select('id', 'nama as full_name')
            ->get();

select * from `kegiatan` where `id` = '464' limit 1
---
    public function fetchKegiatanData(Request $request)
    {
        $kegiatan = Kegiatan::where('id', '=', $request->input('keyword'))->withAll()->first();

select * from `anggaran` where `anggaran`.`id` = '1454' limit 1
select * from `tahapan` where `nama` = 'Musrenbang Kecamatan' limit 1
---
    public function doTransfer(Request $request, $id)
    {
        // -- adding code
        if (empty($request->pilihan)) {
            $this->validate($request, [
                'pilihan' => 'required'
            ]);
        }
        if ($request->pilihan) {
            $this->validate($request, [
                'catatan' => 'required',
                'proposal' => 'required|max:3100'
            ]);
        }
        else {
            $this->validate($request, [
                'catatan' => 'required'
            ]);
        }
        // --

        $path_proposal = null;

        $anggaran = Anggaran::find($id);
        $tahapan = Tahapan::whereNama('Musrenbang Kecamatan')->firstOrFail();