app/Http/Controllers/laporan/desa/LaporanController.php

    public function __construct(DashboardService $dashboard_service)
    {
        $this->dashboard_service = $dashboard_service;
        $this->tahapan = Tahapan::whereNama(\App\Enum\Tahapan::DESA)->first();
---
select * from `tahapan` where `nama` = 'Musrenbang Desa/Kelurahan' limit 1

    public function index(Request $request)
    {
        $opd = $request->user()->opd()->first();
        $village = get_village($request->user()->opd->first()->kode ?? null);
        $villages = Villages::pluck('name', 'id');
        if ($request->user()->hasRole(Roles::KECAMATAN)) {
            if ($opd->jenisOpd && $opd->jenisOpd->nama == Roles::KECAMATAN) {
                $district = Districts::find($opd->kode);
                $villages = Villages::whereDistrictId($opd->kode)->pluck('name', 'id');
---
select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 72 limit 1
select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 72
select `name`, `id` from `villages`
select * from `districts` where `districts`.`id` = '3202080' limit 1
select `name`, `id` from `villages` where `district_id` = '3202080'

    public function preview(Request $request)
    {
        $district = Districts::find($request->get('district_id', null));
        $village = Villages::find($request->get('village_id', null));
---
select * from `districts` where `districts`.`id` = '3202120' limit 1
select * from `villages` where `villages`.`id` = '2147483647' limit 1

    public function show(Request $request)
    {
        $opd = $request->user()->opd()->first();
        $district = $request->get('district', null);
        $village = $request->get('village', null);

        $items = new Anggaran();
        $items = $items->withLaporan()->whereTahapanId($this->tahapan->id);
        $showKecamatan = false;
        $user_id = $request->user()->id;

        $kecamatan = Districts::find($district);
        $desa = Villages::find($village);
---
select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 315 limit 1
select * from `districts` where `districts`.`id` = '3202140' limit 1
select * from `villages` where `villages`.`id` is null limit 1