app/Http/Controllers/laporan/renja/LaporanController.php

select * from `tahapan` where `nama` = 'Rancangan Renja' limit 1
---
    public function __construct(DashboardService $dashboard_service)
    {
        $this->dashboard_service = $dashboard_service;
        $this->tahapan = Tahapan::whereNama(\App\Enum\Tahapan::RANCANGAN_RENJA)->first();

select * from `districts` where `districts`.`id` = '0' limit 1
select * from `villages` where `villages`.`id` = '0' limit 1
select * from `bidang_urusan`
select * from `kegiatan` where `kegiatan`.`id` is null limit 1
select * from `users` where `users`.`id` = '16' limit 1
---
    public function store(Request $request)
    {
//        dd($request->all());
        $district = Districts::find($request->get('district_id', null));
        $village = Villages::find($request->get('village_id', null));
        $urusan= \App\BidangUrusan::all();
        $kegiatan =Kegiatan::find($request->get('program_id',null));


        $user = User::find($request->get('user_id'), null);