app/Http/Controllers/laporan/dewan/LaporanController.php

    public function __construct(DashboardService $dashboard_service)
    {
        $this->dashboard_service = $dashboard_service;
        $this->tahapan = Tahapan::whereNama(\App\Enum\Tahapan::POKOK_PIKIRAN_DEWAN)->first();
---
select * from `tahapan` where `nama` = 'Pokok Pikiran Dewan' limit 1

    public function preview(Request $request)
    {
        $district = Districts::find($request->get('district_id', null));
        $village = Villages::find($request->get('village_id', null));
        $user = User::find($request->get('user_id'), null);
---
select * from `districts` where `districts`.`id` is null limit 1
select * from `villages` where `villages`.`id` is null limit 1
select * from `users` where `users`.`id` is null limit 1

    public function show(Request $request)
    {
        $items = new Anggaran();
        $items = $items->withLaporan()->whereTahapanId($this->tahapan->id);
        $user_id = $request->user()->id;
        $opd = $request->user()->opd()->first();

        if ($request->user()->hasRole(Roles::DPRD)) {
            $items= $items->where('user_id', '=' , $user_id);
            $items = $items->orderBy('district_id', 'ASC');
            $status_pd = true;
        }

        if ($request->user()->hasRole(Roles::OPD)) {
            $items = $items->where('opd_pelaksana_id', '=' , $opd->id);
            $items = $items->orderBy('user_id', 'DESC');
            $status_pd = false;
        }

        $nama = $request->user()->nama_lengkap;

        $items = $items->get();
---
select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 13 limit 1
select * from `anggaran` where `tahapan_id` = 2 and `opd_pelaksana_id` = 31 order by `user_id` desc