app/Http/Controllers/laporan/awal/LaporanController.php

    public function __construct(DashboardService $dashboard_service)
    {
        $this->dashboard_service = $dashboard_service;
        $this->tahapan = Tahapan::whereNama(\App\Enum\Tahapan::RANCANGAN_AWAL)->first();
---
select * from `tahapan` where `nama` = 'Rancangan Awal Renja' limit 1

    public function show(Request $request)
    {
        $district = $request->get('district', null);
        $village = $request->get('village', null);
        $user_id = $request->get('user', null);
        $program = \App\Program::all();

        $items = new Anggaran();
        $items = $items->withLaporan()->whereTahapanId($this->tahapan->id);
        $sasaran =\App\Sasaran::all();
        $indikatorsasaran =\App\IndikatorSasaran::all();
        $kecamatan = Districts::find($district);
        $desa = Villages::find($village);

        $where = '';

        if ($kecamatan) {
            $where .= 'Kecamatan: ' . $kecamatan->name;
        }

        if ($desa) {
            $where .= ', Desa/Kelurahan: ' . $desa->name;
        }

        if ($where){
            $items = $items->where('lokasi', 'LIKE', $where . '%');
        }

        if ($user_id && $user_id != 0) {
            $user = User::find($user_id);
---
select * from `program`
select * from `sasaran`
select * from `indikator_sasaran`
select * from `districts` where `districts`.`id` is null limit 1
select * from `villages` where `villages`.`id` is null limit 1
select * from `users` where `users`.`id` = '11' limit 1