app/Http/Controllers/kecamatan/MusrenbangController.php

    public function index(Request $request)
    {
        $canEntry = can_entry($this->tahapan);
        $user = auth()->user();
        $tahapan = Tahapan::whereNama(\App\Enum\Tahapan::KECAMATAN)->firstOrFail();
        $canManage = false;
        $canTransfer = false;

        $items = new Anggaran();
        if ($user->hasRole(Roles::KECAMATAN)) {
            $canManage = true;
            $items = $items->allByUser();
        }

        if ($user->hasRole(Roles::OPD)) {
            $canTransfer = true;
            $items = $items->whereOpdId($user->opd()->first()->id);
            $items = $items->where('is_desk', '=', '1');
        }

        // fungsi search
        $search = $request->get('search');
        $items = $items->whereTahapanId($tahapan->id)
            ->search($search)
            ->orderBy('created_at', 'ASC')
            ->paginate(10);
---
select * from `tahapan` where `nama` = 'Musrenbang Kecamatan' limit 1
select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 7 limit 1
select * from `anggaran` where `opd_id` = 24 and `is_desk` = '1' and `tahapan_id` = 4 order by `created_at` asc limit 10 offset 70
select count(*) as aggregate from `anggaran` where `opd_id` = 24 and `is_desk` = '1' and `tahapan_id` = 4

    public function edit($id)
    {
        if (! can_entry($this->tahapan)) {
            return error_pages(400, ErrorMessages::CLOSED_ENTRY);
        }

        $user = auth()->user();
        $item = Anggaran::findOrFail($id);
        $jenisLokasi = JenisLokasi::all();
        $sumberAnggarans = SumberAnggaran::all();
        $sumberAnggaranPuguIndikatif = SumberAnggaran::whereNama('Pagu Indikatif')->first();
        $opd = $user->opd()->first();

        if (!$opd) {
            return error_pages(400, 'Akun anda tidak memiliki OPD! </br> Silahkan Hubungi Administrator');
        }

        $district = Districts::find($opd->kode);

        if (! $district) {
            return error_pages(400, 'Anda Tidak terdaftar di OPD KECAMATAN!');
        }

        $villages = Villages::whereDistrictId($opd->kode)->get();
---
select * from `anggaran` where `anggaran`.`id` = '12319' limit 1
select * from `jenis_lokasi`
select * from `sumber_anggaran`
select * from `sumber_anggaran` where `nama` = 'Pagu Indikatif' limit 1
select `opd`.*, `users_opd`.`user_id` as `pivot_user_id`, `users_opd`.`opd_id` as `pivot_opd_id` from `opd` inner join `users_opd` on `opd`.`id` = `users_opd`.`opd_id` where `users_opd`.`user_id` = 58 limit 1
select * from `districts` where `districts`.`id` = '3202040' limit 1
select * from `villages` where `district_id` = '3202040'

    public function transfer($id)
    {
        $item = Anggaran::findOrFail($id);
        $districts = Districts::all();
        $visi = Visi::active();
        $jenisLokasi = JenisLokasi::all();
        $sumberAnggarans = SumberAnggaran::all();
        $sumberAnggaranPuguIndikatif = SumberAnggaran::whereNama('Pagu Indikatif')->first();
---
select * from `anggaran` where `anggaran`.`id` = '15982' limit 1
select * from `districts`
select * from `jenis_lokasi`
select * from `sumber_anggaran`
select * from `sumber_anggaran` where `nama` = 'Pagu Indikatif' limit 1

    public function doTransfer(Request $request, $id)
    {
        if (empty($request->pilihan)) {
            $this->validate($request, [
                'pilihan' => 'required'
            ]);
        }
        if ($request->pilihan) {
            $this->validate($request, [
                'catatan' => 'required'
            ]);
        }
        else {
            $this->validate($request, [
                'catatan' => 'required'
            ]);
        }

        $path_proposal = null;
        $anggaran = Anggaran::find($id);
---
select * from `anggaran` where `anggaran`.`id` = '15227' limit 1


        $anggaran->catatan = $request->catatan;
        $anggaran->proposal = $path_proposal;
        $anggaran->save();

        $anggaran = Anggaran::find($id);
        $tahapan = Tahapan::whereNama(\App\Enum\Tahapan::RANCANGAN_RENJA)->firstOrFail();
        if (!empty($tahapan) && $request->pilihan) {
            $newAnggaran = $this->musrenbang_service->transfer($anggaran, $tahapan->id);
            $anggaran->is_transfer = true;
            $anggaran->save();
---
update `anggaran` set `is_verifikasi` = 1, `updated_at` = '2019-03-04 10:32:54', `catatan` = 'asfags', `proposal` = '' where `id` = 15227
select * from `anggaran` where `anggaran`.`id` = '15227' limit 1
select * from `tahapan` where `nama` = 'Rancangan Renja' limit 1
update `anggaran` set `is_transfer` = 1, `updated_at` = '2019-03-04 10:32:54' where `id` = 15227