app/Http/Controllers/kecamatan/MusrenbangController.php

select * from `anggaran` where `anggaran`.`id` = '4506' limit 1
---
    public function destroy($id)
    {
        if (! can_entry($this->tahapan)) {
            return error_pages(400, ErrorMessages::CLOSED_ENTRY);
        }

        // coding tambahan utk menghapus catatan
        $data = Anggaran::find($id);