app/Http/Controllers/Admin/BidangController.php

    public function index(Request $request)
    {
    	$items = \Spatie\Permission\Models\Permission::all();
---
select * from `permissions`