app/Http/Controllers/Admin/KegiatanController.php

select `id`, `nama`, `catatan` from `kegiatan`
---
    public function index()
    {
        // $items  = Kegiatan::orderBy('created_at', 'DESC')->get();

        $items = DB::table('kegiatan')->select('id','nama','catatan')->get();